<template>
  <section>
    <h2>求職</h2>
    <article>
      <p>
        前一份工作只做到 2018，所以從 2019 年初開始尋找工作。以下是我的職涯方向、上班偏好地點、期望待遇。
      </p>
      <section>
        <h3>職涯方向</h3>
        <section>
          <h4>敏捷工作</h4>
          <p>
            目前最偏好的工作環境是有導入敏捷精神的團隊，暸解並交流彼此對敏捷的看法與經驗。在這類團隊能接受擔任程式開發的職位，也願意延續擔任 ScrumMaster 的職涯。
          </p>
          <p>
            也有興趣加入渴望導入敏捷或是正在嘗試的團隊，並且擔任該團隊的敏捷教練，引導團隊導入適合的敏捷方法。若是現況適合且希望能運行 Scrum，則擔任 ScrumMaster 一職。
          </p>
          <p>
            由於這兩個方向都很看重團隊，希望面試時能安排和團隊交流的部分，讓彼此暸解對方是不是適合彼此。
          </p>
        </section>
        <section>
          <h4>程式開發</h4>
          <p>
            目前在網頁開發上前後端都有涉獵，有 PHP, Ruby, JavaScript (Node.js, Vue.js) 的開發經驗，在開發上傾向繼續深耕這些技術。從大學時期就開始接案，協助案主釐清需求，並從零開始開發出一個可使用的應用程式。
          </p>
        </section>
      </section>
      <section>
        <h3>偏好地點</h3>
        <p>
          若是需要緊密與團隊合作，工作地點偏好在台中。
        </p>
        <p>
          在純開發且偏個人的職缺上，偏好能夠遠端工作，並接受定期去公司開重要會議，其餘溝通則以文字溝通為主，語音溝通為輔。自認擅長釐清需求並寫成規格，且已經有數次接案與實際遠端工作的經驗，因此在遠端合作上有一定的信心。
        </p>
      </section>
      <section>
        <h3>待遇</h3>
        <p>期望年薪在新台幣 815,000 元以上，並根據工作需要付出的時間、經歷與專業程度，往上調整。並預期公司能提供職務上所需且適合的工具，例如筆電等。</p>
      </section>
    </article>
  </section>
</template>

<script>
export default {
  name: 'job_hunting'
}
</script>

<style>

</style>
