<template>
  <div>
    <p>
      在職期間主要擔任 ScrumMaster，並在必要且有餘力時兼職開發人員。主要成就是在公司推廣敏捷精神與方法，並帶團隊逐步導入並執行 Scrum。解決公司開發團隊易受干擾、開發方向不定、產能不穩定以及承諾容易失約⋯⋯等問題。帶來改變的政策主要有：
    </p>
    <ol>
      <li>
        <b>輔導 PM 轉型成 PO：</b><br/>
        讓原 PM 從尷尬的管理職責解放，專注在研究產品價值與開發方向，並且搜集來自於客戶、業務的需求，整理成穩定且有排定優先順序的產品待辦清單，使得團隊在中短期開發方向得以穩定與明確。
      </li><li>
        <b>凝聚團隊意識：</b><br/>
        不斷推廣「團隊」的概念，讓開發人員習慣互相幫忙，讓協作取代合作，並且在無法如期完成某件事情時，不會去譴責個人，而是去思考該怎麼避免這類事情再次發生，提出改善方案。
      </li><li>
        <b>引導團隊自主成長：</b><br/>
        期間擔任 ScrumMaster，帶領團隊在日常與回顧會議時探索團隊的內外部問題，討論出解決方案去嘗試，並持續改進。逐一排除團隊在開發上所遇到的障礙。
      </li><li>
        <b>改善估算準確度：</b><br/>
        導入規劃點數的概念，在每次規劃會議時使用規劃撲克去評估需求成本，以排定適合下一次衝刺的清單。並在每次衝刺結束後，紀錄團隊規劃點數的狀況，包括改變、完成率，以做為下次規劃的參考依據。讓團隊暸解自己產能的極限以及變動的範圍。
      </li><li>
        <b>協商短期規劃：</b><br/>
        透過規劃會議並搭配規劃點數，協調團隊產能與 PO 對完成的期望，讓團隊訂出每次衝刺合適的待辦清單。團隊因此得以在能力所及下，穩定產出有品質的程式碼，並且可以將預定的項目都完成。不易再發生被迫答應一堆項目卻完成不了，導致公司內部之間與客戶對公司信任感降低的困境。
      </li><li>
        <b>集中回饋資訊：</b><br/>
        透過檢視會議提供公司內部對產品最新成果進行檢視與交流的討論平台，讓同事們有一個可以表達看法的空間，得以搜集完整回饋，又能夠降低在平時直接對開發人員表達看法造成的干擾。
      </li><li>
        <b>推廣 Code Review：</b><br/>
        分享自有的經驗，並在團隊熱烈討論下，訂定出適合團隊的 Code Review 標準與方法，成功實踐。透過 Code Review，團隊提升了程式碼品質，並且讓一份程式碼至少有兩個人理解，也常透過 Code Review 展開程式設計相關討論，建立交流機會並且建立團隊默契與文化。
      </li><li>
        <b>建立產品線標準：</b><br/>
        引導團隊訂定政策，去實踐合適的 Git 協作流程，降低專案版本紊亂的問題，並且成功為為主要專案都建立 CI/CD，不再仰賴容易出錯且消耗團隊產能的人工部署。
      </li><li>
        <b>引入驗證思維：</b><br/>
        透過長期規劃相關主題的分享，讓公司決策人員暸解先驗證想法再開發的重要性，逐漸在產品開發線上導入驗證的流程，避免再開發出無人問津的功能或產品。
      </li>
    </ol>
    <p>
      在公司近一年期間，進行約 10 次內部主題分享，講述的多是敏捷相關主題。並嘗試在初期不特別講述 Scrum 專有名詞，而是將其中重要的概念分享，讓團隊能比較暸解其精神，而不拘泥於跑 Scrum 的形式。讓團隊自行選擇適合當前需求的元素，在適當的時機導入，而不是一股腦的全部引入，在約半年的時間將 Scrum 的元素都導入與落實。在就職期間主持過 13 次回顧會議、11 次規劃會議、與 12 次檢視會議，並協助其中 2 位同事嘗試規劃與主持另外 3 次回顧會議。
    </p>
    <p>
      在公司近一年的時間團隊能進行多項改變與進步，也仰賴該公司團隊本身的積極性與既有的團隊文化，ScrumMaster 所做的就是引導，但成功卻是整個團隊共同成就的。與團隊共事所獲得的經驗與心得，也在「2019 iT 邦幫忙鐵人賽」寫成 Agile 主題的系列文《為團隊與組織導入敏捷的經驗分享》，獲得該主題的冠軍。
    </p>
  </div>
</template>
